<?php

return [
    'required' => "%s 항목은 필수 입력입니다.",
    'in' => "%s 항목은 반드시 %s 중의 하나이어야 합니다.",
    'integer' => "%s 항목은 정수만 입력 가능합니다.",
    'numeric' => "%s 항목은 숫자만 입력 가능합니다.",
    'min' => "%s 항목은 최소 %d자 이상 입력해주시기 바랍니다.",
    'max' => "%s 항목은 최대 %d자 이하 입력해주시기 바랍니다.",
    'size' => "%s 항목은 %d자 입력해주시기 바랍니다.",
    'email' => "%s 항목에 올바른 이메일 주소를 입력해주시기 바랍니다.",
    'alpha' => "%s 항목은 알파벳만 입력 가능합니다",
    'alpha_numeric' => "%s 항목은 알파벳, 숫자만 입력 가능합니다.",
    'alpha_numeric_spaces' => "%s 항목은 알파벳, 숫자, 공백만 입력 가능합니다.",
    'alpha_dash' => "%s 항목은 알파벳, 숫자, _(언더바) , -(가운데바) 만 입력이 가능합니다.",
    'base64' => "%s 항목은 Base64 에 사용되는 문자 이외의 문자를 포함되어 있습니다.",
    'url' => "%s 항목에 올바른 URL 을 입력해주시기 바랍니다.",
    'match' => "%s 항목이 일치하지 않습니다.",
    'token_check' => "토큰정보가 일치하지 않습니다.",
];
